import streamlit as st
import pandas as pd

st.title("🥽南宁美食探索")
st.text("探索广西南宁最受欢迎的美食地点！选择你感兴趣的餐厅类型，查看评分和位置。")
st.header("🗺南宁美食地图")

restaurants_data = {
    "餐厅": ["尝不忘(体育路店)", "KFC(盛天地店)", "三品王(朝阳百盛店)", "麦当劳(爱琴海店)", "蜜雪冰城(桃花源店)"],
    "类型": ["中餐", "中餐", "快餐", "自助餐", "西餐"],
    "评分": [4.2, 4.5, 4.0, 4.7, 4.3],
    "人均消费(元)": [15, 20, 25, 35, 50],
     'latitude':[22.800752,22.810761,22.814813,22.813654,22.877677],
    'longitude':[108.313224,108.401252,108.322737,108.423010,108.308964]
}
df = pd.DataFrame(restaurants_data)

st.map(df)



st.header("📊餐厅评分")
st.bar_chart(df, x='餐厅',y='评分')

st.header("📊不同类型餐厅价格")
st.line_chart(df, x='类型',y='人均消费(元)')

yye_data = {
    "月份": ['01月','02月','03月','04月','05月','06月'],
    "尝不忘": [33000, 27000, 35000, 35000,42000,45000],
    "肯德基": [42000, 22000, 37000, 38000,45000,39000],
    "三品王": [33000, 25000, 38000, 35000,39000,47000],
    "麦当劳": [33000, 27000, 35000, 37000,42000,44000],
    "蜜雪冰城": [55000, 42000, 50000, 48000,49000,45000],
}
df1 = pd.DataFrame(yye_data)

st.header("🔑上半年各餐厅营业额")
st.area_chart(df1, x='月份',y=['尝不忘','肯德基','三品王','麦当劳','蜜雪冰城'])

